Revit 2027 API
ScheduleDefinition.CanFilterByValuePresence Method
 Checks whether a field can be used with a value presence-based filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanFilterByValuePresence(
	ScheduleFieldId fieldId
)
Public Function CanFilterByValuePresence (
	fieldId As ScheduleFieldId
) As Boolean
public:
bool CanFilterByValuePresence(
	ScheduleFieldId^ fieldId
)
member CanFilterByValuePresence :
        fieldId : ScheduleFieldId -> bool
Parameters
fieldId ScheduleFieldId
 The ID of the field to check.
Return Value
Boolean
 True if the field can be used with a value presence filter, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  fieldId is not the ID of a field in this ScheduleDefinition.
ArgumentNullException |  A non-optional argument was null
Remarks
 The value presence filter types are HasValue and HasNoValue.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace